
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/tentuku10/aws-ecs-terraform/actions/runs/4518416147)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0278fc0070a502a87]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0312363f840ed32db]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-063f1b3398ef3436e]
aws_security_group.ecs: Refreshing state... [id=sg-0bbafcedff85edc6f]
aws_security_group.alb: Refreshing state... [id=sg-055b6e15e06b167b9]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e3c37a3581b6687d]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d51ee8b7132b0410]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-033690c6548d62613]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0307139f37e6298a4]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05bcf52febed18f77]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0af9cf614a51dcacc]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f062c3f08f6c956d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02846bfbfc65dfced]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1809363762]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0f562c8585bb5a0cc]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-013217273682e9add]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-030c658c088747c74]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-004be7179a24dcc16]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b2a6d187f62a1ecb]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03952cd353f2e41f7]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02846bfbfc65dfced1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0307139f37e6298a41080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-033690c6548d626131080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "go-app-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-055b6e15e06b167b9",
        ]
      + subnets                                     = [
          + "subnet-05bcf52febed18f77",
          + "subnet-0d51ee8b7132b0410",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-app-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0312363f840ed32db"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb_target_group.target_group: Creating...
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:635808309755:targetgroup/go-app-target-group/721e8662c3cc56d0]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Creation complete after 2m14s [id=arn:aws:elasticloadbalancing:ap-northeast-1:635808309755:loadbalancer/app/go-app-alb/7d090edf7111de88]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:635808309755:listener/app/go-app-alb/7d090edf7111de88/6b32ffc2b370331a]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:635808309755:listener-rule/app/go-app-alb/7d090edf7111de88/6b32ffc2b370331a/36d25c4bfc8945e0]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"3e1749420c3c9a4518a94826332de8cda135ae4c","Vars":{},"WorkflowName":"Terraform"} -->